Что выведет данный код и почему?

for i in range(1, 4):
 for j in range(1, 3):
    print(i * j, end = " ")

Ответ: 1 2 2 4 3 6

Почему?
Внешний цикл for даёт нам цифры 1,2,3
Внутренний цикл for даёт нам цифры 1,2
Теперь перемножаем цифры внешнего цикла на цифры внутреннего.
И мы перемножаем их до тех пор, пока у нас не закончится внешний цикл.
При i = 1: выводится 1 x 1 = 1 и 1 x 2 = 2; записываем 1 2
При i = 2: выводится 2 x 1 = 2 и 2 x 2 = 4; записываем 1 2 2 4
При i = 3: выводится 3 x 1 = 3 и 3 x 2 = 6; записываем 1 2 2 4 3 6

end = " " означает, что после каждого числа ставится пробел вместо переноса строки.

