# Главное меню программы.

def display_menu():
        print('-' * 25)
        print("*** Главное меню. ***")
        print('-' * 25)
        print("1. Байты в Килобайты")
        print("2. Килобайты в Мегабайты")
        print("3. Мегабайты в Гигабайты")
        print("4. Гигабайты в Терабайты")
        print('-' * 25)
        print("5. Килобайты в Байты")
        print("6. Мегабайты в Килобайты")
        print("7. Гигабайты в Мегабайты")
        print("8. Терабайты в Гигабайты")
        print("9. Выход")
        print('-' * 25)