def menu():

# Главное меню программы.
        print('[   Меню   ]')
        print('0, Выход из программы.') # value 0.
        print('1, A. Правый верхний угол.') # value1.
        print('2, Б. Левый нижний угол.') # value2.
        print('3, В. Верхний треугольник.') # value3.
        print('4, Г. Нижний треугольник.') # value4.
        print('5, Д. Песочные часы.') # value5.
        print('6, Е. Песочные часы на боку.') # value6.
        print('7, Ж. Левый треугольник.') # value7.
        print('8, З. Правый треугольник.') # value8.
        print('9, И. Левый верхний угол.') # value9.
        print('10, К. Правый нижний угол.') # value10.