# Библиотека (книжная коллекция).

# Не забываем: словарь подтягивается БЕЗ функции, иначе получим ошибку:
# TypeError: 'dict' object is not callable.

books = {'Властелин колец': {'Автор': 'Джон Рональд Руэл Толкин', 'Жанр': 'Фэнтези', 'Год выпуска': '1954-1955', 'Количество страниц': '752', 'Издательство': 'АСТ'},
          'Игра престолов': {'Автор': 'Джордж Реймонд Ричард Мартин', 'Жанр': 'Фэнтези', 'Год выпуска': '1996', 'Количество страниц' : '864', 'Издательство' : 'АСТ'},
          'Кровь и железо': {'Автор': 'Джо Аберкромби', 'Жанр': 'Фэнтези', 'Год выпуска': '2006', 'Количество страниц' : '529', 'Издательство' : 'ЭКСМО'},
           'Стража! Стража!': {'Автор': 'Терри Пратчет', 'Жанр': 'Фэнтези', 'Год выпуска': '1989', 'Количество страниц' : '496', 'Издательство' : 'ЭКСМО'},
           'Девять принцев Эмбера': {'Автор': 'Роджер Желязны', 'Жанр': 'Фэнтези', 'Год выпуска': '1970', 'Количество страниц' : '320', 'Издательство' : 'ЭКСМО'},
           'Крещение огнем': {'Автор': 'Анджей Сапковский', 'Жанр': 'Фэнтези', 'Год выпуска': '1996', 'Количество страниц' : '384', 'Издательство': 'АСТ'},
          }