Готовый билд программы "Транслитерация". Версия 1.0

В данной версии, данные берутся из словаря под названием Dictionary.json и перегоняются в файл OUT.txt.
Направление перевода можно выбрать в главном меню программы.
Кодировка для файла OUT.txt по умолчанию сразу выставлена на UTF-8, дабы не было проблем с выводом символов
кирилицы и латиницы.

Программа понимает только файл Dictionary.json, если переименовать его, например, в файл Dictionary1.json,
или просто удалить, заругается на отсутствие файла рядом с .exe-шником и предложит выйти из программы по
нажатию на Enter.

* ДЛЯ СЕБЯ. НЕ ЗАБЫТЬ. Допилить функционал, чтобы можно было подкидывать словари с разными именами.
* СДЕЛАТЬ ЗАГРУЗКУ .JSON-ов !!!
