# Пример №1.
# --------------------------------------------------
print('Пример #1.')
name = "Алиса"
age = 25

print(f'Привет, меня зовут {name}, мне {age} лет.')
print('-' * 75)
# --------------------------------------------------

# Пример №2.
# --------------------------------------------------
print('Пример #2.')
a = 10
b = 5

print(f'Сумма {a} + {b} = {a + b}')
print('-' * 75)
# --------------------------------------------------

# Пример №3.
# --------------------------------------------------
print('Пример #3.')
temperature = 22.5
weather = "солнечная погода"

print(f'Сегодня в Перми ожидается {weather} и температура около {temperature} °C.')
print('-' * 75)
# --------------------------------------------------

# Пример №4.
# --------------------------------------------------
print('Пример #4.')
name = "Алиса"
age = 30
scores = [85, 92, 78]

result = (
    f"Имя: {name}\n"
    f"Возраст: {age} лет\n"
    f"Средний балл: {sum(scores) / len(scores):.2f}\n" # сумма оценок делится на количество, т.е. 255 / 3 = 85.00.
    f"Обратный порядок оценок: {scores[::-1]}\n"
    f"Статус: {'совершеннолетняя' if age >= 18 else 'несовершеннолетняя'}"
)

print(result)
print('-' * 75)
# --------------------------------------------------

# Пример №5.
# --------------------------------------------------
print('Пример #5.')
name = "Андрей"
age = 30
balance = 12345.6789

is_adult = age >= 18

message = (
    f"  Пользователь: {name}\n"
    f"  Возраст: {age} лет\n"
    f"  Статус: {'совершеннолетний' if is_adult else 'несовершеннолетний'}\n"
    f"  Баланс: ${balance:,.2f}"
)

print(message)
print('-' * 75)