# Задача:
# 1) Сформировать два списка разной длины, содержащие случайные целые числа.
# 2) Сформировать третий список, содержащий элементы обоих списков.
# 3) Сформировать третий список, содержащий элементы обоих списков БЕЗ повторений.
# 4) Сформировать третий список, содержащий элементы общие для двух списков.
# 5) Сформировать третий список, содержащий только уникальные элементы каждого из списков
# (то есть, отдельно для первого и отдельно для второго).
# 6) Сформировать третий список, содержащий только минимальное и максимальное значение каждого из списков.

print('Результаты.') # Надпись "Результаты" над всеми обвязками и выводами команд.

from main_random_lists import * # 1
from main_1_plus_2 import * # 2
from main_1_plus_2_unique import * # 3
from main_1_plus_2_obshie import * # 4
from main_UNIQUE_ELEMENTS import * # 5
from main_min_max import * # 6